tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "spacedriveapp/deps"
brew "webp"
brew "jpeg-xl"
brew "autoconf"
brew "automake"
brew "bat"
brew "glib"
brew "pkg-config"
brew "python@3.9", link: false
brew "cmake"
brew "cmatrix"
brew "cowsay"
brew "docker"
brew "docker-compose"
brew "duf"
brew "emacs"
brew "exa"
brew "harfbuzz"
brew "leptonica"
brew "ffmpeg", link: false
brew "fortune"
brew "fzf"
brew "git-lfs"
brew "glow"
brew "go"
brew "openjdk"
brew "python@3.10"
brew "google-java-format"
brew "htop"
brew "libomp"
brew "jenv"
brew "node", link: false
brew "jupyterlab", link: false
brew "lazygit"
brew "lf"
brew "llvm"
brew "lolcat"
brew "nasm"
brew "neofetch"
brew "node@16", link: true
brew "nvm"
brew "pnpm"
brew "poppler"
brew "python-tk@3.9"
brew "ripgrep"
brew "rmlint"
brew "rsync"
brew "speedtest-cli"
brew "sshpass"
brew "stow"
brew "texlive"
brew "tmux"
brew "tree"
brew "virtualenv"
brew "wget"
brew "xclip"
brew "xdg-ninja"
brew "yarn"
brew "youtube-dl"
brew "zig"
brew "zsh"
brew "zsh-syntax-highlighting"
cask "adobe-creative-cloud"
cask "adoptopenjdk8"
cask "alacritty"
cask "amethyst"
cask "basictex"
cask "dozer"
cask "firefox"
cask "font-iosevka"
cask "hiddenbar"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "keycastr"
cask "kitty"
cask "mattermost"
cask "microsoft-teams"
cask "miniforge"
cask "neovide"
cask "obs"
cask "rectangle"
cask "spotify"
cask "visual-studio-code"
cask "vlc"
cask "zoom"
cask "zulip"
